# Split Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewSchedule..::..Split Method
ViewSchedule Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Split(IList<(Of <<'(Double>)>>)) | Splits the schedule into several segments by given height of each segment. |
| Split(Int32) | Splits the schedule into several segments by given segment number. |

# See Also
ViewSchedule Class
ViewSchedule Members
Autodesk.Revit.DB Namespace